In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
dframe = DataFrame(np.arange(12).reshape(3,4),
                  index = ['NYC','LA','SF'],
                  columns = ['A','B','C','D'])

In [4]:
dframe

     A  B   C   D
NYC  0  1   2   3
LA   4  5   6   7
SF   8  9  10  11

In [10]:
#lowercase
dframe.index.map(str.lower)

pandas.core.indexes.base.Index

In [8]:
dframe.index = dframe.index.map(str.lower)

In [9]:
dframe

     A  B   C   D
nyc  0  1   2   3
la   4  5   6   7
sf   8  9  10  11

In [11]:
# str.title cap the first letter
dframe.rename(index = str.title,columns = str.lower)

     a  b   c   d
Nyc  0  1   2   3
La   4  5   6   7
Sf   8  9  10  11

In [13]:
# rename index and column names through a dictionary
dframe.rename(index  = {'ny': 'New York'},
                        columns = {'A':'ALPHA'})

     ALPHA  B   C   D
nyc      0  1   2   3
la       4  5   6   7
sf       8  9  10  11

In [14]:
dframe

     A  B   C   D
nyc  0  1   2   3
la   4  5   6   7
sf   8  9  10  11